; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem satellite-80)
 (:domain satellite)
 (:objects 
    sat1 sat2 sat3 sat4 sat5 sat6 sat7 sat8 sat9 - satellite
    ins1 ins2 ins3 ins4 ins5 ins6 ins7 ins8 ins9 ins10 ins11 ins12 ins13 ins14 ins15 ins16 ins17 - instrument
    mod1 mod2 mod3 - mode
    dir1 dir2 dir3 dir4 dir5 dir6 dir7 dir8 dir9 - direction
    )
 (:init 
    (pointing sat1 dir1)
    (pointing sat2 dir5)
    (pointing sat3 dir1)
    (pointing sat4 dir8)
    (pointing sat5 dir9)
    (pointing sat6 dir6)
    (pointing sat7 dir4)
    (pointing sat8 dir7)
    (pointing sat9 dir1)
    (power_avail sat1)
    (power_avail sat2)
    (power_avail sat3)
    (power_avail sat4)
    (power_avail sat5)
    (power_avail sat6)
    (power_avail sat7)
    (power_avail sat8)
    (power_avail sat9)
    (calibration_target ins1 dir2)
    (calibration_target ins2 dir5)
    (calibration_target ins3 dir3)
    (calibration_target ins4 dir5)
    (calibration_target ins5 dir8)
    (calibration_target ins6 dir5)
    (calibration_target ins7 dir5)
    (calibration_target ins8 dir7)
    (calibration_target ins9 dir6)
    (calibration_target ins10 dir7)
    (calibration_target ins11 dir4)
    (calibration_target ins12 dir8)
    (calibration_target ins13 dir7)
    (calibration_target ins14 dir5)
    (calibration_target ins15 dir1)
    (calibration_target ins16 dir9)
    (calibration_target ins17 dir6)
    (on_board ins1 sat6)
    (on_board ins2 sat2)
    (on_board ins3 sat1)
    (on_board ins4 sat7)
    (on_board ins5 sat8)
    (on_board ins6 sat9)
    (on_board ins7 sat5)
    (on_board ins8 sat4)
    (on_board ins9 sat3)
    (on_board ins10 sat7)
    (on_board ins11 sat5)
    (on_board ins12 sat4)
    (on_board ins13 sat4)
    (on_board ins14 sat1)
    (on_board ins15 sat1)
    (on_board ins16 sat8)
    (on_board ins17 sat3)
    (supports ins4 mod3)
    (supports ins1 mod1)
    (supports ins11 mod3)
    (supports ins14 mod2)
    (supports ins10 mod1)
    (supports ins6 mod3)
    (supports ins15 mod2)
    (supports ins17 mod3)
    (supports ins10 mod3)
    (supports ins6 mod2)
    (supports ins13 mod3)
    (supports ins12 mod3)
    (supports ins15 mod1)
    (supports ins8 mod3)
    (supports ins5 mod1)
    (supports ins15 mod3)
    (supports ins9 mod3)
    (supports ins17 mod1)
    (supports ins6 mod1)
    (supports ins9 mod2)
    (supports ins11 mod2)
    (supports ins12 mod2)
    (supports ins9 mod1)
    (supports ins7 mod1)
    (supports ins8 mod1)
    (supports ins10 mod2)
    (supports ins2 mod1)
    (supports ins5 mod3)
    (supports ins8 mod2)
    (supports ins14 mod3)
    (supports ins2 mod2)
    (supports ins16 mod2)
    (supports ins7 mod3)
    (supports ins5 mod2)
    (supports ins3 mod2))
 (:goal (and 
(have_image dir2 mod2)
(have_image dir3 mod2)
(have_image dir5 mod2)
(have_image dir6 mod2)
(have_image dir8 mod2)
(have_image dir9 mod2)
(have_image dir1 mod3)
(have_image dir2 mod3)
(have_image dir3 mod3)
(have_image dir4 mod3)
))
)

; plan
1. (switch_on ins15 sat1)
   deleted: (power_avail sat1)
   added: (power_on ins15)
   goals met: 0 of 10
2. (calibrate sat1 ins15 dir1)
   added: (calibrated ins15)
   goals met: 0 of 10
3. (take_image sat1 dir1 ins15 mod3)
   added: (have_image dir1 mod3)
   goals met: 1 of 10
4. (turn_to sat1 dir2 dir1)
   deleted: (pointing sat1 dir1)
   added: (pointing sat1 dir2)
   goals met: 1 of 10
5. (take_image sat1 dir2 ins15 mod2)
   added: (have_image dir2 mod2)
   goals met: 2 of 10
6. (take_image sat1 dir2 ins15 mod3)
   added: (have_image dir2 mod3)
   goals met: 3 of 10
7. (turn_to sat1 dir8 dir2)
   deleted: (pointing sat1 dir2)
   added: (pointing sat1 dir8)
   goals met: 3 of 10
8. (take_image sat1 dir8 ins15 mod2)
   added: (have_image dir8 mod2)
   goals met: 4 of 10
9. (turn_to sat1 dir3 dir8)
   deleted: (pointing sat1 dir8)
   added: (pointing sat1 dir3)
   goals met: 4 of 10
10. (take_image sat1 dir3 ins15 mod2)
   added: (have_image dir3 mod2)
   goals met: 5 of 10
11. (take_image sat1 dir3 ins15 mod3)
   added: (have_image dir3 mod3)
   goals met: 6 of 10
12. (turn_to sat1 dir4 dir3)
   deleted: (pointing sat1 dir3)
   added: (pointing sat1 dir4)
   goals met: 6 of 10
13. (take_image sat1 dir4 ins15 mod3)
   added: (have_image dir4 mod3)
   goals met: 7 of 10
14. (turn_to sat1 dir5 dir4)
   deleted: (pointing sat1 dir4)
   added: (pointing sat1 dir5)
   goals met: 7 of 10
15. (take_image sat1 dir5 ins15 mod2)
   added: (have_image dir5 mod2)
   goals met: 8 of 10
16. (turn_to sat1 dir6 dir5)
   deleted: (pointing sat1 dir5)
   added: (pointing sat1 dir6)
   goals met: 8 of 10
17. (take_image sat1 dir6 ins15 mod2)
   added: (have_image dir6 mod2)
   goals met: 9 of 10
18. (turn_to sat1 dir9 dir6)
   deleted: (pointing sat1 dir6)
   added: (pointing sat1 dir9)
   goals met: 9 of 10
19. (take_image sat1 dir9 ins15 mod2)
   added: (have_image dir9 mod2)
   goals met: 10 of 10
